astb_relise/src/Reports/ВыданныеСИЗПоВидуУчета/ВыданныеСИЗПоВидуУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыданныеСИЗПоВидуУчета</name>
</mdclass:Report>

astb_relise/src/InformationRegisters/МВЗСотрудников/МВЗСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗСотрудников</name>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ОсновноеМестоРаботыСотрудника/ОсновноеМестоРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновноеМестоРаботыСотрудника</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </resources>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/МВЗПодразделений/МВЗПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗПодразделений</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/AccumulationRegisters/ВыданныеСредстваЗащиты/ВыданныеСредстваЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыданныеСредстваЗащиты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеВыводитьВыдачуВ_ЛК</name>
    <comment>АСТБ_Горюшин_Алексей_19561</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/НоменклатурныеНомераОрганизаций/НоменклатурныеНомераОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатурныеНомераОрганизаций</name>
  <resources>
    <name>НоменклатурныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ВидыОперацийВыдачиСИЗ/ВидыОперацийВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВыдачиСИЗ</name>
  <enumValues>
    <name>ПредварительнаяЗаявка</name>
  </enumValues>
  <enumValues>
    <name>ФактическаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ВидыУчетаКомплектов/ВидыУчетаКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаКомплектов</name>
  <enumValues>
    <name>УчитыватьКакКомплект</name>
  </enumValues>
  <enumValues>
    <name>УчитыватьКакКомплектующие</name>
  </enumValues>
  <enumValues>
    <name>УчитыватьСогласноВыдаче</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВыдачаДежурныхСредствЗащиты/ВыдачаДежурныхСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаДежурныхСредствЗащиты</name>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Reports/ВыданныеСИЗПоВидуУчета/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();// Получаем настройки отчета
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	
	Если Настройки.Отбор.Элементы[0].Использование Тогда //включен отбор по организации
	    ТекущаяОрганизация = Настройки.Отбор.Элементы[0].ПравоеЗначение;
	Иначе
		ТекущаяОрганизация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрВыводитьСИЗсПроцентомИзноса = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьСИЗсПроцентомИзноса"));
	Если не ПараметрВыводитьСИЗсПроцентомИзноса = Неопределено Тогда
		ВыводитьСИЗсПроцентомИзноса = ПараметрВыводитьСИЗсПроцентомИзноса.Значение;
		ПараметрВыводитьСИЗсПроцентомИзноса.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если не ПараметрПериод = Неопределено Тогда
		НачалоПериода 	= ПараметрПериод.Значение.ДатаНачала;
		КонецПериода 	= ПараметрПериод.Значение.ДатаОкончания;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ,
	|	МВЗСотрудников.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудника.Период КАК Период,
	|	ОсновноеМестоРаботыСотрудника.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудника.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудника.МоментВремени КАК МоментВремени,
	|	ОсновноеМестоРаботыСотрудника.ОсновноеМестоРаботы КАК ОсновноеМестоРаботы,
	|	ОсновноеМестоРаботыСотрудника.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудника.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновныеМестаРаботыСотрудников
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника КАК ОсновноеМестоРаботыСотрудника
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудника.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ОсновныеМестаРаботыСотрудников.Период, &Период)) КАК КонецПериода,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	|	ВложенныйЗапрос.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ПериодыРаботыСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ОсновныеМестаРаботыСотрудников.Период КАК Период,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник КАК Сотрудник,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Подразделение КАК Подразделение,
	|		ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени КАК МоментВремени,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Организация КАК Организация,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Должность КАК Должность
	|	ИЗ
	|		ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|	ГДЕ
	|		ВТ_ОсновныеМестаРаботыСотрудников.ОсновноеМестоРаботы) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|		ПО ВложенныйЗапрос.Сотрудник = ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник
	|			И ВложенныйЗапрос.МоментВремени < ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени
	|			И ВложенныйЗапрос.Организация = ВТ_ОсновныеМестаРаботыСотрудников.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВложенныйЗапрос.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.Период,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)),
	|	ВложенныйЗапрос.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗПодразделений.Период КАК Период,
	|	МВЗПодразделений.Подразделение КАК Подразделение,
	|	МВЗПодразделений.МВЗ КАК МВЗ,
	|	МВЗПодразделений.Использовать КАК Использовать,
	|	МВЗПодразделений.МоментВремени КАК МоментВремени,
	|	МВЗПодразделений.Подразделение.Владелец КАК Организация
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений КАК МВЗПодразделений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.МВЗ КАК МВЗ,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_МВЗПодразделений.Период, &Период)) КАК КонецПериода,
	|	ВложенныйЗапрос.МоментВремени КАК МоментВремени,
	|	ВложенныйЗапрос.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ПериодыМВЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_МВЗПодразделений.Период КАК Период,
	|		ВТ_МВЗПодразделений.Подразделение КАК Подразделение,
	|		ВТ_МВЗПодразделений.МВЗ КАК МВЗ,
	|		ВТ_МВЗПодразделений.МоментВремени КАК МоментВремени,
	|		ВТ_МВЗПодразделений.Организация КАК Организация
	|	ИЗ
	|		ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|	ГДЕ
	|		ВТ_МВЗПодразделений.Использовать) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВложенныйЗапрос.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|			И ВложенныйЗапрос.МоментВремени < ВТ_МВЗПодразделений.МоментВремени
	|			И ВложенныйЗапрос.Организация = ВТ_МВЗПодразделений.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.МВЗ,
	|	ВложенныйЗапрос.МоментВремени,
	|	ВложенныйЗапрос.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект КАК Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|		КОНЕЦ) КАК КоличествоСумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Сумма) КАК СуммаСумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ КАК МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ КАК ВидВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад КАК Склад,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Поставщик КАК Поставщик,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ДокументыВыдачиПредварательная
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|	И ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидОперации = &ВидОперацииВыдачиСИЗ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И ВЫБОР
	|			КОГДА &ВыводитьСИЗсПроцентомИзноса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код = 0
	|					ИЛИ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Поставщик,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура,
	|	ВыдачаДежурныхСредствЗащитыТовары.ХарактеристикаНоменклатуры,
	|	СУММА(ВыдачаДежурныхСредствЗащитыТовары.Количество),
	|	ВыдачаДежурныхСредствЗащитыТовары.Цена,
	|	СУММА(ВыдачаДежурныхСредствЗащитыТовары.Сумма),
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)),
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Сотрудник,
	|	ВыдачаДежурныхСредствЗащитыТовары.НормаВыдачи.ВидВыдачиСИЗ,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Организация,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Склад,
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура.Поставщик,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Дата,
	|	ВыдачаДежурныхСредствЗащитыТовары.НормаВыдачи,
	|	ВыдачаДежурныхСредствЗащитыТовары.НоменклатураНормы
	|ИЗ
	|	Документ.ВыдачаДежурныхСредствЗащиты.Товары КАК ВыдачаДежурныхСредствЗащитыТовары
	|ГДЕ
	|	НЕ ВыдачаДежурныхСредствЗащитыТовары.Ссылка.ПредварительнаяСборка
	|	И ВЫБОР
	|			КОГДА &ВыводитьСИЗсПроцентомИзноса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыдачаДежурныхСредствЗащитыТовары.ПроцентИзноса.Код = 0
	|					ИЛИ ВыдачаДежурныхСредствЗащитыТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Проведен
	|	И ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура,
	|	ВыдачаДежурныхСредствЗащитыТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаДежурныхСредствЗащитыТовары.Цена,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Сотрудник,
	|	ВыдачаДежурныхСредствЗащитыТовары.НормаВыдачи.ВидВыдачиСИЗ,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Организация,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Склад,
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура.Поставщик,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Дата,
	|	ВыдачаДежурныхСредствЗащитыТовары.НормаВыдачи,
	|	ВыдачаДежурныхСредствЗащитыТовары.НоменклатураНормы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|		КОНЕЦ),
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Сумма),
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Поставщик,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад.АвтоматизированнаяВыдача = ИСТИНА
	|	И НЕ &ВидОперацииВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И ВЫБОР
	|			КОГДА &ВыводитьСИЗсПроцентомИзноса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код = 0
	|					ИЛИ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Поставщик,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВыдачиПредварательная.Комплект КАК Комплект,
	|	ВТ_ДокументыВыдачиПредварательная.Номенклатура КАК Номенклатура,
	|	ВТ_ДокументыВыдачиПредварательная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДокументыВыдачиПредварательная.Цена КАК Цена,
	|	ВТ_ДокументыВыдачиПредварательная.Ссылка КАК Ссылка,
	|	ВТ_ДокументыВыдачиПредварательная.Сотрудник КАК Сотрудник,
	|	ВТ_ДокументыВыдачиПредварательная.КоличествоСумма КАК Количество,
	|	ВТ_ДокументыВыдачиПредварательная.СуммаСумма КАК Сумма,
	|	ВТ_ДокументыВыдачиПредварательная.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_ДокументыВыдачиПредварательная.Организация КАК Организация,
	|	ВТ_ДокументыВыдачиПредварательная.Склад КАК Склад,
	|	ВТ_ДокументыВыдачиПредварательная.Поставщик КАК Поставщик,
	|	ВТ_ДокументыВыдачиПредварательная.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ДокументыВыдачиПредварательная.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ДокументыВыдачиПредварательная.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ДокументыВыдачи
	|ИЗ
	|	ВТ_ДокументыВыдачиПредварательная КАК ВТ_ДокументыВыдачиПредварательная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОбороты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащитыОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВыданныеСредстваЗащитыОбороты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	|			ТОГДА ВыданныеСредстваЗащитыОбороты.Регистратор.МВЗ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|	КОНЕЦ КАК МВЗ,
	|	ВыданныеСредстваЗащитыОбороты.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОбороты.НормаВыдачи КАК НормаВыдачи,
	|	ВыданныеСредстваЗащитыОбороты.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОбороты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащитыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащитыОбороты.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыданныеСредстваЗащитыОбороты.КоличествоПриход КАК Количество
	|ПОМЕСТИТЬ ВТ_ПриходПоВыдаче
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|				КОГДА &ВыводитьСИЗсПроцентомИзноса
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПроцентИзноса.Код = 0
	|						ИЛИ ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|			КОНЕЦ) КАК ВыданныеСредстваЗащитыОбороты
	|ГДЕ
	|	(ВыданныеСредстваЗащитыОбороты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	|			ИЛИ ВыданныеСредстваЗащитыОбороты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВыдачи.Комплект КАК Комплект,
	|	ВЫБОР
	|		КОГДА ВТ_ДокументыВыдачи.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВТ_ПриходПоВыдаче.Номенклатура
	|		ИНАЧЕ ВТ_ДокументыВыдачи.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_ДокументыВыдачи.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВТ_ПриходПоВыдаче.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ВТ_ДокументыВыдачи.ХарактеристикаНоменклатуры
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДокументыВыдачи.Цена КАК Цена,
	|	ВТ_ПриходПоВыдаче.Регистратор КАК Ссылка,
	|	ВТ_ПриходПоВыдаче.Сотрудник КАК Сотрудник,
	|	ВТ_ПриходПоВыдаче.МВЗ КАК МВЗ,
	|	ВТ_ДокументыВыдачи.Количество КАК Количество,
	|	ВТ_ДокументыВыдачи.Сумма КАК Сумма,
	|	ВТ_ДокументыВыдачи.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_ПриходПоВыдаче.Организация КАК Организация,
	|	ВТ_ДокументыВыдачи.Склад КАК Склад,
	|	ВТ_ДокументыВыдачи.Поставщик КАК Поставщик,
	|	ВТ_ПриходПоВыдаче.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПриходПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПриходПоВыдаче.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаПоРегистру
	|ИЗ
	|	ВТ_ПриходПоВыдаче КАК ВТ_ПриходПоВыдаче
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыВыдачи КАК ВТ_ДокументыВыдачи
	|		ПО ВТ_ПриходПоВыдаче.Регистратор = ВТ_ДокументыВыдачи.Ссылка
	|			И ВТ_ПриходПоВыдаче.Сотрудник = ВТ_ДокументыВыдачи.Сотрудник
	|			И (ВТ_ПриходПоВыдаче.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|				ИЛИ ВТ_ПриходПоВыдаче.НормаВыдачи = ВТ_ДокументыВыдачи.НормаВыдачи)
	|			И ВТ_ПриходПоВыдаче.НоменклатураНормы = ВТ_ДокументыВыдачи.НоменклатураНормы
	|			И (ВЫБОР
	|				КОГДА ВТ_ДокументыВыдачи.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ВТ_ПриходПоВыдаче.Номенклатура = ВТ_ДокументыВыдачи.Номенклатура
	|				ИНАЧЕ ВТ_ПриходПоВыдаче.Номенклатура = ВТ_ДокументыВыдачи.Комплект
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_ДокументыВыдачи.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ВТ_ПриходПоВыдаче.ХарактеристикаНоменклатуры = ВТ_ДокументыВыдачи.ХарактеристикаНоменклатуры
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ВТ_ДокументыВыдачи.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоРегистру.Комплект КАК Комплект,
	|	ВТ_ВыдачаПоРегистру.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаПоРегистру.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ВыдачаПоРегистру.Количество) КАК Количество,
	|	ВТ_ВыдачаПоРегистру.Цена КАК Цена,
	|	СУММА(ВТ_ВыдачаПоРегистру.Сумма) КАК Сумма,
	|	ВТ_ВыдачаПоРегистру.Ссылка КАК ДокументВыдачи,
	|	ВТ_ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоРегистру.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВТ_ПериодыРаботыСотрудников.МВЗ
	|		ИНАЧЕ ВТ_ВыдачаПоРегистру.МВЗ
	|	КОНЕЦ КАК МВЗ,
	|	ВТ_ВыдачаПоРегистру.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_ВыдачаПоРегистру.Организация КАК Организация,
	|	ВТ_ВыдачаПоРегистру.Склад КАК Склад,
	|	ВТ_ВыдачаПоРегистру.Поставщик КАК Поставщик,
	|	ВТ_ПериодыРаботыСотрудников.Должность КАК Должность,
	|	ВТ_ВыдачаПоРегистру.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоРегистру.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоРегистру.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаПоРегистру.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ВыдачаСПодразделениями
	|ИЗ
	|	ВТ_ВыдачаПоРегистру КАК ВТ_ВыдачаПоРегистру
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыРаботыСотрудников КАК ВТ_ПериодыРаботыСотрудников
	|		ПО ВТ_ВыдачаПоРегистру.Сотрудник = ВТ_ПериодыРаботыСотрудников.Сотрудник
	|			И ВТ_ВыдачаПоРегистру.Ссылка.Дата <= ВТ_ПериодыРаботыСотрудников.КонецПериода
	|			И ВТ_ВыдачаПоРегистру.Ссылка.Дата > ВТ_ПериодыРаботыСотрудников.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаПоРегистру.Комплект,
	|	ВТ_ВыдачаПоРегистру.Номенклатура,
	|	ВТ_ВыдачаПоРегистру.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаПоРегистру.Цена,
	|	ВТ_ВыдачаПоРегистру.Ссылка,
	|	ВТ_ПериодыРаботыСотрудников.Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоРегистру.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВТ_ПериодыРаботыСотрудников.МВЗ
	|		ИНАЧЕ ВТ_ВыдачаПоРегистру.МВЗ
	|	КОНЕЦ,
	|	ВТ_ВыдачаПоРегистру.ВидВыдачи,
	|	ВТ_ВыдачаПоРегистру.Организация,
	|	ВТ_ВыдачаПоРегистру.Склад,
	|	ВТ_ВыдачаПоРегистру.Поставщик,
	|	ВТ_ПериодыРаботыСотрудников.Должность,
	|	ВТ_ВыдачаПоРегистру.НормаВыдачи,
	|	ВТ_ВыдачаПоРегистру.НоменклатураНормы,
	|	ВТ_ВыдачаПоРегистру.ДатаВыдачи,
	|	ВТ_ВыдачаПоРегистру.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСПодразделениями.Комплект КАК Комплект,
	|	ВТ_ВыдачаСПодразделениями.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСПодразделениями.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ВыдачаСПодразделениями.Количество) КАК Количество,
	|	ВТ_ВыдачаСПодразделениями.Цена КАК Цена,
	|	СУММА(ВТ_ВыдачаСПодразделениями.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПодразделениями.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВТ_ПериодыМВЗ.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка))
	|		ИНАЧЕ ВТ_ВыдачаСПодразделениями.МВЗ
	|	КОНЕЦ КАК МВЗ,
	|	ВТ_ВыдачаСПодразделениями.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_ВыдачаСПодразделениями.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_ВыдачаСПодразделениями.Организация КАК Организация,
	|	ВТ_ВыдачаСПодразделениями.Склад КАК Склад,
	|	ВТ_ВыдачаСПодразделениями.Поставщик КАК Поставщик,
	|	ВТ_ВыдачаСПодразделениями.Подразделение КАК Подразделение,
	|	ВТ_ВыдачаСПодразделениями.Должность КАК Должность,
	|	ВТ_ВыдачаСПодразделениями.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаСПодразделениями.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаСПодразделениями.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаСПодразделениями.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ВыдачаСМВЗ
	|ИЗ
	|	ВТ_ВыдачаСПодразделениями КАК ВТ_ВыдачаСПодразделениями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыМВЗ КАК ВТ_ПериодыМВЗ
	|		ПО ВТ_ВыдачаСПодразделениями.Подразделение = ВТ_ПериодыМВЗ.Подразделение
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата <= ВТ_ПериодыМВЗ.КонецПериода
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата > ВТ_ПериодыМВЗ.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаСПодразделениями.Комплект,
	|	ВТ_ВыдачаСПодразделениями.Номенклатура,
	|	ВТ_ВыдачаСПодразделениями.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСПодразделениями.Цена,
	|	ВТ_ВыдачаСПодразделениями.ДокументВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПодразделениями.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВТ_ПериодыМВЗ.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка))
	|		ИНАЧЕ ВТ_ВыдачаСПодразделениями.МВЗ
	|	КОНЕЦ,
	|	ВТ_ВыдачаСПодразделениями.ВидВыдачи,
	|	ВТ_ВыдачаСПодразделениями.Организация,
	|	ВТ_ВыдачаСПодразделениями.Склад,
	|	ВТ_ВыдачаСПодразделениями.Поставщик,
	|	ВТ_ВыдачаСПодразделениями.Подразделение,
	|	ВТ_ВыдачаСПодразделениями.Должность,
	|	ВТ_ВыдачаСПодразделениями.НормаВыдачи,
	|	ВТ_ВыдачаСПодразделениями.НоменклатураНормы,
	|	ВТ_ВыдачаСПодразделениями.ДатаВыдачи,
	|	ВТ_ВыдачаСПодразделениями.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСМВЗ.Комплект КАК Комплект,
	|	ВТ_ВыдачаСМВЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСМВЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ВыдачаСМВЗ.Количество) КАК Количество,
	|	ВТ_ВыдачаСМВЗ.Цена КАК Цена,
	|	СУММА(ВТ_ВыдачаСМВЗ.Цена * ВТ_ВыдачаСМВЗ.Количество) КАК Сумма,
	|	ВТ_ВыдачаСМВЗ.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_ВыдачаСМВЗ.МВЗ КАК МВЗ,
	|	ВТ_ВыдачаСМВЗ.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_ВыдачаСМВЗ.Организация КАК Организация,
	|	ВТ_ВыдачаСМВЗ.Склад КАК Склад,
	|	ВТ_ВыдачаСМВЗ.Поставщик КАК Поставщик,
	|	ВТ_ВыдачаСМВЗ.Подразделение КАК Подразделение,
	|	ВТ_ВыдачаСМВЗ.Должность КАК Должность,
	|	ВТ_ВыдачаСМВЗ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаСМВЗ.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаСМВЗ.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаСМВЗ.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ВыдачаСМВЗ КАК ВТ_ВыдачаСМВЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаСМВЗ.Комплект,
	|	ВТ_ВыдачаСМВЗ.Номенклатура,
	|	ВТ_ВыдачаСМВЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСМВЗ.Цена,
	|	ВТ_ВыдачаСМВЗ.ДокументВыдачи,
	|	ВТ_ВыдачаСМВЗ.МВЗ,
	|	ВТ_ВыдачаСМВЗ.ВидВыдачи,
	|	ВТ_ВыдачаСМВЗ.Организация,
	|	ВТ_ВыдачаСМВЗ.Склад,
	|	ВТ_ВыдачаСМВЗ.Поставщик,
	|	ВТ_ВыдачаСМВЗ.Подразделение,
	|	ВТ_ВыдачаСМВЗ.Должность,
	|	ВТ_ВыдачаСМВЗ.НормаВыдачи,
	|	ВТ_ВыдачаСМВЗ.НоменклатураНормы,
	|	ВТ_ВыдачаСМВЗ.ДатаВыдачи,
	|	ВТ_ВыдачаСМВЗ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатурныеНомераОрганизаций.Организация КАК Организация,
	|	НоменклатурныеНомераОрганизаций.Номенклатура КАК Номенклатура,
	|	НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	НоменклатурныеНомераОрганизаций.НоменклатурныйНомер КАК НоменклатурныйНомер
	|ПОМЕСТИТЬ ВТ_НоменклатурныеНомера
	|ИЗ
	|	РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Комплект КАК Комплект,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.Цена КАК Цена,
	|	ВТ_Результат.Сумма КАК Сумма,
	|	ВТ_Результат.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_Результат.МВЗ КАК МВЗ,
	|	ВТ_Результат.ВидВыдачи КАК ВидВыдачи,
	|	ВТ_Результат.Организация КАК Организация,
	|	ВТ_Результат.Склад КАК Склад,
	|	ВТ_Результат.Поставщик КАК Поставщик,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Должность КАК Должность,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_НоменклатурныеНомера.НоменклатурныйНомер, ""не определен"") КАК НоменклатурныйНомер
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатурныеНомера КАК ВТ_НоменклатурныеНомера
	|		ПО ВТ_Результат.Организация = ВТ_НоменклатурныеНомера.Организация
	|			И ВТ_Результат.Номенклатура = ВТ_НоменклатурныеНомера.Номенклатура
	|			И ВТ_Результат.ХарактеристикаНоменклатуры = ВТ_НоменклатурныеНомера.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВТ_Результат.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Комплект.Наименование,
	|	ВТ_Результат.Номенклатура.Наименование,
	|	ВТ_Результат.ХарактеристикаНоменклатуры.КодSAP,
	|	ВТ_Результат.ДокументВыдачи.МоментВремени,
	|	Количество УБЫВ,
	|	ВТ_Результат.МВЗ.Наименование";
	
	Запрос.УстановитьПараметр("ДатаНачала",					НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания",				КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ВыводитьСИЗсПроцентомИзноса",ВыводитьСИЗсПроцентомИзноса);
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	Если ЗначениеЗаполнено(ТекущаяОрганизация) И ТипЗнч(ТекущаяОрганизация) = Тип("СправочникСсылка.Организации") Тогда
		Если ТекущаяОрганизация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
			Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", ?(ТекущаяОрганизация.ЗаполнениеППСприКоллективнойВыдаче = 0,Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка,Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача));
		Иначе
			Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	КонецЕсли;
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВыдачи = ТаблицаЗапроса.Скопировать();
	ТаблицаВыдачи.Очистить();
	
	МассивОбработанныхСтрок = Новый Массив; //нужен для сборки комплектов, чтобы не добавлять лишние строки
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыЗапроса.Комплект) Тогда //комплект разобран
			
			Если СтрокаТаблицыЗапроса.Комплект.ВидУчетаКомплектаДляППС = Перечисления.ВидыУчетаКомплектов.УчитыватьКакКомплектующие 
				ИЛИ СтрокаТаблицыЗапроса.Комплект.ВидУчетаКомплектаДляППС = Перечисления.ВидыУчетаКомплектов.УчитыватьСогласноВыдаче Тогда //ничего не делаем
				ЗаполнитьЗначенияСвойств(ТаблицаВыдачи.Добавить(),СтрокаТаблицыЗапроса);				
				Продолжить;
			КонецЕсли;	
			
			Если НЕ МассивОбработанныхСтрок.Найти(ТаблицаЗапроса.Индекс(СтрокаТаблицыЗапроса)) = Неопределено Тогда //комплект обработан
				Продолжить;
			КонецЕсли;
			
			ПервоеКомплектующее 			= СтрокаТаблицыЗапроса.Комплект.Комплектующие[0].Номенклатура;
			ПервоеКомплектующееКоличество 	= СтрокаТаблицыЗапроса.Комплект.Комплектующие[0].Количество;
			
			//нужно собрать комплект
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Комплект",		СтрокаТаблицыЗапроса.Комплект);
			СтруктураПоиска.Вставить("ДокументВыдачи",	СтрокаТаблицыЗапроса.ДокументВыдачи);
			СтруктураПоиска.Вставить("МВЗ",				СтрокаТаблицыЗапроса.МВЗ);
			
			НайденныеСтроки = ТаблицаЗапроса.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				МассивОбработанныхСтрок.Добавить(ТаблицаЗапроса.Индекс(НайденнаяСтрока));
				
				Если НайденнаяСтрока.Номенклатура = ПервоеКомплектующее Тогда // подбираем размер комплекта и заполняем таблицу
					
					Если ЗначениеЗаполнено(НайденнаяСтрока.ХарактеристикаНоменклатуры) Тогда //ищем размер комплекта
						
						ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("Метрика",НайденнаяСтрока.ХарактеристикаНоменклатуры.Метрика,,СтрокаТаблицыЗапроса.Комплект);
						Количество 					= СтрокаТаблицыЗапроса.Количество / ?(ПервоеКомплектующееКоличество = 0, 1, ПервоеКомплектующееКоличество);
						
						СтруктураПоискаСобственныхСИЗ = Новый Структура;
						СтруктураПоискаСобственныхСИЗ.Вставить("Номенклатура",				СтрокаТаблицыЗапроса.Комплект);
						СтруктураПоискаСобственныхСИЗ.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
						СтруктураПоискаСобственныхСИЗ.Вставить("ДокументВыдачи",			СтрокаТаблицыЗапроса.ДокументВыдачи);
						СтруктураПоискаСобственныхСИЗ.Вставить("МВЗ",						СтрокаТаблицыЗапроса.МВЗ);
						
						НоваяСтрока = ТаблицаВыдачи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
						НоваяСтрока.Номенклатура 				= СтрокаТаблицыЗапроса.Комплект;
						НоваяСтрока.Количество 					= Количество;
						НоваяСтрока.Цена 						= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(НоваяСтрока.Номенклатура,СтрокаТаблицыЗапроса.Организация,СтрокаТаблицыЗапроса.ДатаВыдачи,СтрокаТаблицыЗапроса.Номенклатура.Поставщик);
						НоваяСтрока.Сумма 						= ?(НоваяСтрока.Цена = NULL,0,НоваяСтрока.Цена) * НоваяСтрока.Количество;
						НоваяСтрока.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
						
					Иначе
						
						Количество = СтрокаТаблицыЗапроса.Количество / ?(ПервоеКомплектующееКоличество = 0, 1, ПервоеКомплектующееКоличество);
						
						СтруктураПоискаСобственныхСИЗ = Новый Структура;
						СтруктураПоискаСобственныхСИЗ.Вставить("Номенклатура",				СтрокаТаблицыЗапроса.Комплект);
						СтруктураПоискаСобственныхСИЗ.Вставить("ХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
						СтруктураПоискаСобственныхСИЗ.Вставить("ДокументВыдачи",			СтрокаТаблицыЗапроса.ДокументВыдачи);
						СтруктураПоискаСобственныхСИЗ.Вставить("МВЗ",						СтрокаТаблицыЗапроса.МВЗ);
						
						НоваяСтрока = ТаблицаВыдачи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
						НоваяСтрока.Номенклатура 	= СтрокаТаблицыЗапроса.Комплект;
						НоваяСтрока.Количество 		= Количество;
						НоваяСтрока.Цена 			= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(НоваяСтрока.Номенклатура,СтрокаТаблицыЗапроса.Организация,СтрокаТаблицыЗапроса.ДатаВыдачи,СтрокаТаблицыЗапроса.Номенклатура.Поставщик);
						НоваяСтрока.Сумма 			= ?(НоваяСтрока.Цена = NULL,0,НоваяСтрока.Цена) * НоваяСтрока.Количество;
						
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		Иначе //комплект собран
			
			Если СтрокаТаблицыЗапроса.Номенклатура.Комплект Тогда 
				
				Если СтрокаТаблицыЗапроса.Номенклатура.ВидУчетаКомплектаДляППС = Перечисления.ВидыУчетаКомплектов.УчитыватьСогласноВыдаче 
					ИЛИ СтрокаТаблицыЗапроса.Номенклатура.ВидУчетаКомплектаДляППС = Перечисления.ВидыУчетаКомплектов.УчитыватьКакКомплект Тогда //ничего не делаем
					ЗаполнитьЗначенияСвойств(ТаблицаВыдачи.Добавить(),СтрокаТаблицыЗапроса);
					Продолжить;
				КонецЕсли;
				
				//нужно разобрать комплект на комплектующие
				Если ЗначениеЗаполнено(СтрокаТаблицыЗапроса.ХарактеристикаНоменклатуры) Тогда //подбор размеров комплектующих
					
					Для Каждого Комплектующее Из СтрокаТаблицыЗапроса.Номенклатура.Комплектующие Цикл
						
						ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("Метрика",СтрокаТаблицыЗапроса.ХарактеристикаНоменклатуры.Метрика,,Комплектующее.Номенклатура);
						Количество 					= СтрокаТаблицыЗапроса.Количество * Комплектующее.Количество;
						
						СтруктураПоискаСобственныхСИЗ = Новый Структура;
						СтруктураПоискаСобственныхСИЗ.Вставить("Номенклатура",				Комплектующее.Номенклатура);
						СтруктураПоискаСобственныхСИЗ.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
						СтруктураПоискаСобственныхСИЗ.Вставить("ДокументВыдачи",			СтрокаТаблицыЗапроса.ДокументВыдачи);
						СтруктураПоискаСобственныхСИЗ.Вставить("МВЗ",						СтрокаТаблицыЗапроса.МВЗ);
						
						НоваяСтрока = ТаблицаВыдачи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
						НоваяСтрока.Номенклатура 				= Комплектующее.Номенклатура;
						НоваяСтрока.Количество 					= Количество;
						НоваяСтрока.Цена 						= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(НоваяСтрока.Номенклатура,СтрокаТаблицыЗапроса.Организация,СтрокаТаблицыЗапроса.ДатаВыдачи,СтрокаТаблицыЗапроса.Номенклатура.Поставщик);
						НоваяСтрока.Сумма 						= ?(НоваяСтрока.Цена = NULL,0,НоваяСтрока.Цена) * НоваяСтрока.Количество;
						НоваяСтрока.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
						
					КонецЦикла;
					
				Иначе //размеры комплектующих не подбираем
					
					Для Каждого Комплектующее Из СтрокаТаблицыЗапроса.Номенклатура.Комплектующие Цикл
						
						Количество = СтрокаТаблицыЗапроса.Количество * Комплектующее.Количество;
						
						СтруктураПоискаСобственныхСИЗ = Новый Структура;
						СтруктураПоискаСобственныхСИЗ.Вставить("Номенклатура",				Комплектующее.Номенклатура);
						СтруктураПоискаСобственныхСИЗ.Вставить("ХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
						СтруктураПоискаСобственныхСИЗ.Вставить("ДокументВыдачи",			СтрокаТаблицыЗапроса.ДокументВыдачи);
						СтруктураПоискаСобственныхСИЗ.Вставить("МВЗ",						СтрокаТаблицыЗапроса.МВЗ);
						
						НоваяСтрока = ТаблицаВыдачи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
						НоваяСтрока.Номенклатура 	= Комплектующее.Номенклатура;
						НоваяСтрока.Количество 		= Количество;
						НоваяСтрока.Цена 			= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(НоваяСтрока.Номенклатура,СтрокаТаблицыЗапроса.Организация,СтрокаТаблицыЗапроса.ДатаВыдачи,СтрокаТаблицыЗапроса.Номенклатура.Поставщик);
						НоваяСтрока.Сумма 			= ?(НоваяСтрока.Цена = NULL,0,НоваяСтрока.Цена) * НоваяСтрока.Количество;
						
					КонецЦикла;	
					
				КонецЕсли;	
				
			Иначе //обычная номенклатура - ничего не делаем
				
				ЗаполнитьЗначенияСвойств(ТаблицаВыдачи.Добавить(),СтрокаТаблицыЗапроса);
				
			КонецЕсли;	
			
		КонецЕсли;	
	
	КонецЦикла;
	
	НаборыВнешнихДанных = Новый Структура;
	НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаВыдачи);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	//Инициализировать(<Макет>, <ВнешниеНаборыДанных>, <ДанныеРасшифровки>, <ВозможностьИспользованияВнешнихФункций>) 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,НаборыВнешнихДанных , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьВыданноеКоличествоКомплектов(Комплект,Номенклатура,ВыданоКомплектующего)
	
	НайденныеСтроки = Комплект.Комплектующие.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Возврат 0;
		
	Иначе
		
		КоличествоКомплектующего = НайденныеСтроки[0].Количество;
		
		Если КоличествоКомплектующего = 0 Тогда
			Возврат 0;
		Иначе
			Возврат ВыданоКомплектующего/КоличествоКомплектующего;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецФункции
